#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

        name       = "hsiar_dart"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_phar"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "46e420db-1e86-4076-9465-e11942b42f79"
        name       = "hsiar_phar"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_ppd"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "0b047f28-be9c-42de-be94-1ecd4d4e6f31"
        name       = "hsiar_ppd"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_wfa"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "340b5e49-f79b-472d-a039-82f1310e7580"
        name       = "hsiar_wfa"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["opho"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "e414e809-f9db-4ab6-bfdc-6a4c68555479"
        name       = "opho"
        # (2 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-pho-rsc-groups"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "7f3f1d82-2373-4705-9036-8ddfba8c5181"
        name       = "view-client-pho-rsc-groups"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-GROUPS.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      + description                                = "PHO RStudio Connect Analytics Platform team groups, which are used for organizing users of the platform according to their respective teams. "
        id                                         = "d7bbe09f-9a45-4d40-83ad-c1cc17855d57"
      + name                                       = "PHO RStudio Connect - Team Groups"
        # (22 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-MANAGEMENT.keycloak_group.GROUP will be created
  + resource "keycloak_group" "GROUP" {
      + id       = (known after apply)
      + name     = "PHO-RSC Management"
      + path     = (known after apply)
      + realm_id = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC-MANAGEMENT.keycloak_group_roles.GROUP_ROLES will be created
  + resource "keycloak_group_roles" "GROUP_ROLES" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "moh_applications"
      + role_ids   = [
          + "1ba3bbcb-d2db-4cb3-be33-2f88062e0dac",
          + "2e4a2cc3-bcd3-461b-9b5a-90d928f6f385",
          + "2ea1ec2c-1603-46a2-a348-6d0c7ce559da",
          + "44f14440-f320-4b49-aae8-c1e1a346f2a6",
          + "7f3f1d82-2373-4705-9036-8ddfba8c5181",
          + "8742c7c0-664c-4321-8225-f70420d299f7",
          + "a43ca1ce-6e81-4dc3-9961-07f4d2cc7b70",
          + "beddbeb0-650e-4bd9-8484-d05f789c61b6",
          + "f539f4bf-ba7a-4ba3-a8d4-a47f786e205d",
        ]
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*